########
# Taps #
########

tap "homebrew/core"
tap "homebrew/bundle"                 # Makes it possible to use this file!
tap "homebrew/services"               # Simplifies the process of running services with launchctl.
tap "caskroom/fonts"                  # For fonts (e.g. Fira Code)
tap "caskroom/versions"
tap "caskroom/cask"                   # For installing Casks.
tap "universal-ctags/universal-ctags" # CTags for Vim

############
# Packages #
############

brew "openssl"
brew "awscli"
brew "cfssl"                # Cloudflare's PKI toolkit.
brew "diff-so-fancy"        # Fancier diff.
brew "fd"                   # Yet another alternative to 'find'.
brew "direnv"               # Directory-specific environment variables.
brew "fzf"                  # Fuzzy search.
brew "git"
brew "gnupg"
brew "hub"                  # Github helper.
brew "highlight"            # Syntax highlighting.
brew "htop"                 # Better 'top'.
brew "httpie"               # Better 'curl'.
brew "jq"                   # JSON processor.
brew "macvim", link: false
brew "ncdu"                 # Disk space analyser.
brew "neovim"
brew "nmap"                 # Port scanning.
brew "nvm"                  # Node.js version manager.
brew "pre-commit"           # Pre-commit hooks.
brew "pv"                   # Monitor progress through a pipe.
brew "pyenv"                # Python version manager.
brew "rbenv"                # Ruby version manager.
brew "rename"               # Easier batch renaming.
brew "st"                   # Simple statistics tool.
brew "terminal-notifier"
brew "terraform"
brew "the_silver_searcher"  # Yet another alternative to 'grep'.
brew "tree"                 # GNU tree utility.
brew "wget"
brew "z"                    # Jump to directories based on "frecency".
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

#########
# Casks #
#########

cask "appcleaner"           # Completely wipes an app and associated data.
cask "bartender"            # Allows hiding unnecessary menu bar apps.
cask "boom-3d"              # You know, for sound!
cask "dash"                 # Documentation on steroids.
cask "free-ruler"           # Old but pretty solid visual ruler.
cask "genymotion"
cask "hyper"                # I prefer iTerm 2 though.
cask "jetbrains-toolbox"
cask "keybase"
cask "kitematic"            # Visual Docker container manager.
cask "lastpass"
cask "macvim"
cask "noti"                 # Android notifications on Mac.
cask "rescuetime"           # So I can track my distractions!
cask "skitch"               # Better screenshot-ting.
cask "slack"
cask "spectacle"            # Window organiser I can't live without!
cask "spotify"
cask "virtualbox"
cask "visual-studio-code"
cask "vivaldi"
cask "caskroom/fonts/font-consolas-for-powerline"
cask "caskroom/fonts/font-fira-code"                      # Coolest font ever.
cask "caskroom/fonts/font-fira-mono-for-powerline"
cask "caskroom/fonts/font-menlo-for-powerline"
cask "caskroom/fonts/font-meslo-for-powerline"
cask "caskroom/fonts/font-source-code-pro-for-powerline"
cask "caskroom/versions/docker-edge"
cask "caskroom/versions/firefox-developer-edition"
cask "caskroom/versions/java8"
cask "caskroom/versions/opera-developer"
