########
# Taps #
########

tap "domt4/autoupdate"                # Auto-update for Homebrew!
tap "github/gh"                       # Github CLI.
tap "goles/battery"                   # For battery.
tap "homebrew/cask"                   # For installing Casks.
tap "homebrew/cask-drivers"           # For Logitech Options.
tap "homebrew/cask-fonts"             # For fonts (e.g. Fira Code)
tap "homebrew/cask-versions"          # Provides alternate versions of casks.
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/bundle"                 # Makes it possible to use this file!
tap "homebrew/services"               # Simplifies the process of running services with launchctl.
tap "muesli/tap"                      # For duf tool.
tap "universal-ctags/universal-ctags" # CTags for Vim

############
# Packages #
############

brew "openssl"
brew "ack"
brew "ag"
brew "awscli"
brew "asciinema"
brew "cowsay"               # Just because, why not?
brew "diff-so-fancy"        # Fancier diff.
brew "duf"                  # Better du (the htop of du!)
brew "fd"                   # Yet another alternative to 'find'.
brew "firebase-cli"
brew "direnv"               # Directory-specific environment variables.
brew "fortune"              # Digital fortune cookie.
brew "fzf"                  # Fuzzy search.
brew "terraform_landscape"  # Better formatting for terraform diffs.
brew "gawk"                 # GNU Awk.
brew "gh"                   # Github CLI.
brew "git"
brew "git-extras"           # Pretty useful extra commands for Git.
brew "git-secrets"          # Prevent from committing secrets and credentials.
brew "gnupg"
brew "go"
brew "graphviz"             # For UML diagram generation using PlantUML.
brew "grc"                  # Generic colouriser (e.g. ping).
brew "hub"                  # Github helper.
brew "highlight"            # Syntax highlighting.
brew "htop"                 # Better 'top'.
brew "httpie"               # Better 'curl'.
brew "java"                 # OpenJDK.
brew "jq"                   # JSON processor.
brew "json-table"           # Print JSON as a table JSON.
brew "lolcat"               # Rainbows and unicorns in terminal.
brew "macvim", link: false
brew "mas"                  # CLI for Mac App Store.
brew "ncdu"                 # Disk space analyser.
brew "neovim"
brew "nmap"                 # Port scanning.
brew "nnn"                  # Noice is Not Noice, a nicer fork...
brew "nvm"                  # Node.js version manager.
brew "pinentry-mac"         # For entering GPG signing passphrase.
brew "pre-commit"           # Pre-commit hooks.
brew "postgres"
brew "pv"                   # Monitor progress through a pipe.
brew "pyenv"                # Python version manager.
brew "ranger"               # CLI file manager.
brew "rbenv"                # Ruby version manager.
brew "rename"               # Easier batch renaming.
brew "scroll-reverser"      # Reverse scroll direction (useful when using natural scrolling with trackpad). No longer needed as Logitech software does this natively.
brew "shellcheck"           # Static analysis and linting for Bash scripts.
brew "spark"                # Sparkline.
brew "speedcrunch"          # Keyboard-centric scientific calculator.
brew "speedtest-cli"
brew "st"                   # Simple statistics tool.
brew "stress"               # Stress testing for the system system.
brew "terminal-notifier"
brew "tfenv"                # Terraform version manager.
brew "the_silver_searcher"  # Yet another alternative to 'grep'.
brew "thefuck"              # Correct the f*cked up commands! 
brew "tldr"                 # More helpful man pages.
brew "trash"
brew "tree"                 # GNU tree utility.
brew "typespeed"            # Speed typing command-line game.
brew "ultralist"            # CLI task management.
brew "vercel-cli"
brew "watch"
brew "watchman"             # File watching service.
brew "wget"
brew "wrk"                  # Better alternative to 'ab'.
brew "yarn"
brew "ykman"                # Yubikey manager.
brew "z"                    # Jump to directories based on "frecency".
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

#########
# Casks #
#########

# Fonts

cask "font-consolas-for-powerline"
cask "font-fira-code"             # Coolest font ever.
cask "font-jetbrains-mono"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-rubik"
cask "font-source-code-pro"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-quattro"
cask "font-ia-writer-mono"

# Applications

cask "alfred"
cask "appcleaner"           # Completely wipes an app and associated data.
cask "appium"               # Mobile app automation.
cask "avibrazil-rdm"        # Custom resolutions on Retina display.
cask "aws-vault"            # Credentials management for AWS.
cask "bartender"            # Allows hiding unnecessary menu bar apps.
cask "betterzip"            # Quicklook generator for zip files.
#cask "boom-3d"             # You know, for sound! Was getting bloated, so trying out eqmac.
cask "caret"                # The ultimate markdown editor.
cask "cheatsheet"           # Cmd key keyboard shortcut cheatsheet for current app.
cask "docker-edge"
cask "dash"                 # Documentation on steroids.
cask "dropbox"
cask "eqmac"                # Open source equaliser. Replaces Boom for me.
cask "evernote"
cask "firefox-developer-edition"
cask "free-ruler"           # Old but pretty solid visual ruler.
cask "gas-mask"             # Hosts file manager.
# cask "genymotion"         # Not using these days due to emulator improvements in recent years.
cask "google-chrome"
cask "google-cloud-sdk"     # For things like gcloud CLI.
cask "hyper"                # I prefer iTerm 2 though.
cask "imageoptim"           # Makes images take less space without sacrificing quality.
cask "iterm2"
cask "jetbrains-toolbox"
cask "keepingyouawake"      # Amphetamine alternative available as a Cask.
cask "keybase"
cask "kindle"
# cask "kitematic"          # Visual Docker container manager.
cask "lastpass"
cask "licecap"              # Gif recording.
cask "logitech-options"
cask "marta"                # File system browser.
cask "macdown"
cask "notion"
cask "ngrok"                # Localhost HTTP tunneling FTW!
cask "noti"                 # Android notifications on Mac.
cask "opera-developer"
cask "paw"
cask "pennywise"            # Always-on-top floating browser.
cask "pluralsight"
#cask "pocket-casts"
#cask "product-hunt"
cask "rescuetime"           # So I can track my distractions!
cask "sequel-pro"
cask "sketch"
cask "skitch"               # Better screenshotting.
cask "slack"
cask "spectacle"            # Window organiser I can't live without!
cask "spotify"
cask "tunnelbear"
cask "ubersicht"            # Desktop widgets.
cask "visual-studio-code"
cask "vivaldi"
#cask "webtorrent"
cask "whatsapp"
cask "writemapper"          # Mind mapping.

# Quicklook generators

cask "qlcolorcode"          # Quicklook generator for syntax highlighting for code.
cask "qlimagesize"          # Quicklook generator for showing image size and dimension.
cask "qlmarkdown"           # Quicklook generator for markdown files.
cask "qlprettypatch"        # Quicklook generator for patch files.
cask "qlstephen"            # Quicklook generator for text files without extensions.
cask "qlvideo"              # Quicklook generator for video files.
cask "quicklook-csv"        # Quicklook generator for CSV files.
cask "quicklook-json"       # Quicklook generator for JSON files.
cask "quicklook-pat"        # Quicklook generator for Adobe Pattern files.
cask "quicklookase"         # Quicklook generator for Adobe Swatch Exchange files.
cask "webpquicklook"        # Quicklook generator for WebP files.

#############
# App Store #
#############

mas "Amphetamine", id: 937984704            # Keeps Mac awake!
#mas "Bear", id: 1091189122
mas "Byword", id: 420212497
mas "Fantastical 2", id: 975937182          # The ultimate calendar (installed via mas due to licencing).
mas "FlagTimes", id: 1234952668             # Flags and times in status bar.
mas "Home Assistant", id: 1099568401
#mas "LastPass", id: 926036361               # MacOS app (the cask is for browser plugins). Probably no longer needed.
mas "Noizio", id: 928871589                 # Background noise simulator.
mas "Pixave", id: 924891282
mas "Pocket", id: 568494494
mas "SnippetsLab", id: 1006087419
mas "Trello", id: 1278508951
mas "Unsplash Wallpapers", id: 1284863847
mas "Webcam Settings", id: 533696630
mas "Xcode", id: 497799835
